           MOVE 'MELANCIA  '   TO WRK-PROD(01).
           MOVE 'LARANJA   '   TO WRK-PROD(02).
           MOVE 'LIMAO     '   TO WRK-PROD(03).
           MOVE 'BANANA    '   TO WRK-PROD(04).
           MOVE 'MANGA     '   TO WRK-PROD(05).
           MOVE 'CAQUI     '   TO WRK-PROD(06).
           MOVE 'ABACAXI   '   TO WRK-PROD(07).
           MOVE 'ALFACE    '   TO WRK-PROD(08).
           MOVE 'BETERRABA '   TO WRK-PROD(09).
           MOVE 'TOMATE    '   TO WRK-PROD(10).
           MOVE 'SALSA     '   TO WRK-PROD(11).
           MOVE 'COENTRO   '   TO WRK-PROD(12).

           MOVE 10,00   TO WRK-PRECO(01).
           MOVE 04,00   TO WRK-PRECO(02).
           MOVE 01,99   TO WRK-PRECO(03).
           MOVE 06,00   TO WRK-PRECO(04).
           MOVE 05,50   TO WRK-PRECO(05).
           MOVE 03,80   TO WRK-PRECO(06).
           MOVE 06,99   TO WRK-PRECO(07).
           MOVE 01,50   TO WRK-PRECO(08).
           MOVE 03,10   TO WRK-PRECO(09).
           MOVE 03,90   TO WRK-PRECO(10).
           MOVE 02,99   TO WRK-PRECO(11).
           MOVE 02,99   TO WRK-PRECO(12).
