       IDENTIFICATION DIVISION.
       PROGRAM-ID. SISTEMAVENDAS.
      ********************************
      * AREA DE COMENTARIOS - REMARKS
      * AUTHOR = LUCAS FARIA LURF
      * OBJETIVO: RECEBER VENDAS ATÉ PARAR
      * UTILIZAR COMANDOS PERFORM - UNTIL
      * UTILIZAR COPY NAS VARIAVEIS
      * DATA 08/06/2022
      ********************************
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           COPY 'BOOKVAR.COB'.
       PROCEDURE DIVISION.
       0001-PRINCIPAL.
           PERFORM 0600-MONTAPRODUTOS.
           PERFORM 0100-INICIALIZAR.
           IF WRK-VENDAS > 0
               PERFORM 0200-PROCESSAR UNTIL WRK-VENDAS = 0
           END-IF.
           PERFORM 0202-PROCESSARCOMPRA.
           PERFORM 0203-CALCULATROCO.
           PERFORM 0300-FINALIZAR.

       0100-INICIALIZAR.

           PERFORM 0101-COLETARQUANTIDADE.
           IF WRK-VENDAS > 0
               PERFORM 0102-COLETACODIGO
               PERFORM 0201-PROCESSAVALOR
               ADD WRK-PRECOACM TO WRK-PRECOFINAL
               ADD 1 TO CONTADORPADRAO
               PERFORM 0601-SALVAPRODUTOS
               PERFORM 0602-SALVAQUANTIDADE
           END-IF.

       0101-COLETARQUANTIDADE.
      *********COLETA DE QUANTIDADE****************
           DISPLAY "DIGITE A QUANTIDADE (0 SAIR)".
           ACCEPT WRK-VENDAS.

       0102-COLETACODIGO.
               DISPLAY "CÓDIGO DO PRODUTO:".
               ACCEPT WRK-COD.

       0200-PROCESSAR.
      ***********CALCULO DA MULTIPLICAÇÃO ***********
           ADD 1 TO WRK-QT.
           ADD WRK-VENDAS TO WRK-ACUM.


           PERFORM 0100-INICIALIZAR.
       0201-PROCESSAVALOR.
           COMPUTE WRK-PRECOACM = (WRK-VENDAS * WRK-PRECO(WRK-COD)).

       0202-PROCESSARCOMPRA.
           MOVE WRK-ACUM TO WRK-ACUM-ED.
           MOVE WRK-PRECOFINAL TO WRK-PRECOFINAL-ED.
           PERFORM 0500-CRIARLINHAS.
           DISPLAY WRK-ACUM-ED " ITENS".
           PERFORM VARYING I FROM 1 BY 1 UNTIL I >
               CONTADORPADRAO
               DISPLAY QUANTIDADE(I) " - " WRK-PROD(PRODUTO(I))
               "$" WRK-PRECO(PRODUTO(I))

           END-PERFORM.

           PERFORM 0500-CRIARLINHAS.
           DISPLAY "TOTAL:" WRK-PRECOFINAL-ED.
           PERFORM 0500-CRIARLINHAS.

       0203-CALCULATROCO.
           DISPLAY "DIGITE O RECEBIDO: "
           ACCEPT VALORRECEBIDO.
           COMPUTE TROCO = WRK-PRECOFINAL - VALORRECEBIDO.
           MOVE TROCO TO TROCO-ED.
           MOVE VALORRECEBIDO TO VALORRECEBIDO-ED.
           DISPLAY "VALOR RECEBIDO: " VALORRECEBIDO-ED " | "
                   "TROCO:" TROCO-ED.
           PERFORM 0500-CRIARLINHAS.

      **********TESTE IF PARA VER APROVAÇÃO ****
       0300-FINALIZAR.
           DISPLAY "MUITO OBRIGADO POR UTILIZAR O PROGRAMA".
           STOP RUN.

       0500-CRIARLINHAS.
           DISPLAY "===============".

       0600-MONTAPRODUTOS.
           COPY 'BOOKPROD.cob'.

       0601-SALVAPRODUTOS.
           MOVE WRK-COD TO PRODUTO(CONTADORPADRAO).

       0602-SALVAQUANTIDADE.
           MOVE WRK-VENDAS TO QUANTIDADE(CONTADORPADRAO).
